AUTO_config_TK_pesok/src/Documents/ПланАктивности/ПланАктивности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланАктивности</name>
  <registerRecords>InformationRegister.ПланАктивности</registerRecords>
  <attributes>
    <name>Активность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяМарка</name>
    <type>
      <types>CatalogRef.ТоварныеМарки</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>СкладКомпании</name>
      <type>
        <types>CatalogRef.СкладыКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦелеваяМарка</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ЦелевыеМарки</types>
        <types>CatalogRef.ТоварныеМарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПериода</name>
      <type>
        <types>EnumRef.ВидыПериодаАктивности</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Периоды</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПериода</name>
      <type>
        <types>EnumRef.ВидыПериодаАктивности</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>35</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ЦелеваяМарка</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ЦелевыеМарки</types>
        <types>CatalogRef.ТоварныеМарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолеСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расчет</name>
    <attributes>
      <name>Порог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Напоказ</name>
    <comment>Служит для визуализации поанов</comment>
    <attributes>
      <name>СкладКомпании</name>
      <type>
        <types>CatalogRef.СкладыКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Куратор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/ПланАктивности/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецПроцедуры
	
	Процедура ПриКопировании(ОбъектКопирования)
		Дата = ТекущаяДата();
		
		НачалоДействия = "";
		ОкончаниеДействия = "";
		Комментарий = "";
		Периоды.Очистить();
		Товары.Очистить();
		Планы.Очистить();
		ИнициализироватьДокумент();
	КонецПроцедуры
	
	#Область Прочее
	
	
	#КонецОбласти
	
	
	
	#Область Проведение
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		
		ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
		ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
		ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			И НЕ ЭтоНовый() И Проведен И НЕ Отказ Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Дата КАК Дата
			|ИЗ
			|	Документ.ПланАктивности КАК Док
			|ГДЕ
			|	Док.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ДополнительныеСвойства.Вставить("СтараяДатаДокумента", Выборка.Дата);
			
		Иначе
			ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь);		
		КонецЕсли;
		
		
		
	КонецПроцедуры
	
	Процедура ПриЗаписи(Отказ)
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед") Тогда    
			ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Дата > ДополнительныеСвойства.СтараяДатаДокумента);
		КонецЕсли;
		
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
		
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
		
		Документы.ПланАктивности.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		ПроведениеСервер.ОтразитьПланАктивности(ДополнительныеСвойства, Движения, Отказ);
		
		ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени("ПланАктивностиПроведениеНаСервере",ВремяНачала,,Строка(Ссылка));
		
	КонецПроцедуры
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		Если НЕ ОбменДанными.Загрузка И ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПланПоАктивности")  Тогда
			ПроверяемыеРеквизиты.Добавить("Расчет");	
		КонецЕсли;
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область ИнициализацияИЗаполнение
	
	// Инициализирует документ
	//
	Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
		
		Автор =  Пользователи.ТекущийПользователь();
		Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПланПоАктивности") Тогда
			Активность = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1 %2. Волна № ",
			Формат(Год(ТекущаяДата()),"ЧГ=0"),
			СокрЛП(ТоварнаяМарка));
		Иначе
			Активность = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"План на %1",
			ПредставлениеПериода(НачалоДействия,КонецДня(ОкончаниеДействия),"ФП = Истина"));
		КонецЕсли;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
			
		КонецЕсли;
		
		
	КонецПроцедуры // ИнициализироватьДокумент()
	
	
	
	#КонецОбласти
	
	
#КонецЕсли
